recipes/dan-dan-noodles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dan Dan Noodles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Dan Dan Noodles</h1>
<p>
<a href="https://omnivorescookbook.com/dan-dan-noodles/">Original link</a>
</p>

<div id="outline-container-orgcab9757" class="outline-2">
<h2 id="orgcab9757">Ingredients</h2>
<div class="outline-text-2" id="text-orgcab9757">
</div>
<div id="outline-container-orgeee6f9d" class="outline-3">
<h3 id="orgeee6f9d">Noodle sauce</h3>
<div class="outline-text-3" id="text-orgeee6f9d">
<ul class="org-ul">
<li>1/3 cup Chinese sesame paste (or unsweetened natural peanut butter)</li>
<li>1/3 cup light soy sauce (or soy sauce)</li>
<li>1/4 cup Chinkiang vinegar</li>
<li>4 cloves garlic, finely minced</li>
<li>2 green onion, finely minced</li>
<li>2 tablespoons honey (or agave syrup)</li>
<li>1/2 to 1 teaspoon Sichuan peppercorns, toasted and grounded</li>
</ul>
</div>
</div>

<div id="outline-container-orgf21b49c" class="outline-3">
<h3 id="orgf21b49c">Garnishes</h3>
<div class="outline-text-3" id="text-orgf21b49c">
<ul class="org-ul">
<li>1/3 cup roasted peanuts, crushed</li>
<li>14 oz (400 g) Dan Dan noodles (or thin wheat noodles)</li>
<li>1 small batch leafy green vegetables, roughly chopped (spinach, choy sum, baby bok choy etc.)</li>
<li>(Homemade) chili oil, to taste</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga427da5" class="outline-2">
<h2 id="orga427da5">Method</h2>
<div class="outline-text-2" id="text-orga427da5">
<ol class="org-ol">
<li>Whisk the sesame paste and light soy sauce together in a bowl until fully incorporated. Add the Chinkiang vinegar. Continue stirring until mixed. Then mix in the garlic, green onion, honey, and Sichuan peppercorns.</li>
<li>Cook the noodles according to instructions.</li>
<li>Briefly blanch the leafy green vegetables, drain, and set aside.</li>
<li>For each noodle bowl, add 1/4 cup of noodle sauce. Add the chili oil according to your taste. Add some noodles, then top with green veggies. Garnish with peanut crumbles and chopped green onion. Sprinkle with a pinch of toasted ground Sichuan peppercorn, if you like the numbing taste.</li>
<li>Serve hot or cold.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd13b02a" class="outline-2">
<h2 id="orgd13b02a">Notes</h2>
<div class="outline-text-2" id="text-orgd13b02a">
<ol class="org-ol">
<li>Do add some chili oil even if you prefer not to eat spicy food, because it will add aroma to the sauce and your sauce won’t end up very spicy.</li>
<li>I usually roast the Sichuan peppercorns in a bit of oil until they turn dark brown. Then pat them dry with paper towel and grind them into powder. The oil-roasted peppercorns will be less pungent and have a more rounded flavor. I prefer the cooked peppercorns in cold dishes and sauces so they won’t overpower the other ingredients.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
